{
  "resume_ds": "Hrishikesh Dhole Data Scientist 858-308-2924|hrishikeshdhole0@gmail.com|LinkedIn:- Hrishikesh|GitHub:- Hrish52 SUMMARY Data Scientist with deep expertise in cloud-scale data engineering, machine learning, and advanced analytics. Skilled in building and tuning data pipelines that handle millions of records across AWS, GCP, and Azure environments. Experienced in leveraging Python, SQL, PySpark, and BigQuery to optimize data processing times and support real-time analytics. Proficient in machine learning techniques like NLP, CNN, and SVM for predictive modeling and sentiment analysis, complemented by strong data visualization skills using Power BI, Tableau, and D3.js. Seeking opportunities to drive impactful data solutions and optimize business outcomes through innovative data strategies. EXPERIENCE Data Scientist Apprentice, Costco Wholsale, Seattle, Washington, United StatesJan 2025 - Jun 2025 Led a 5-member capstone project that collected and analyzed ~350 k+ social-media comments from Reddit, Instagram, X, and Costco.com, delivering data-driven insights to Costco’s IT Data Science team. Automated data collection with Apify, Phantombuster, Selenium, and BeautifulSoup, integrating multi-platform scraping and API extraction to cut manual data-prep time by 80 % and ensure consistent, high-quality inputs for sentiment analysis. Processed and normalized unstructured comment data to create a clean, analytics-ready corpus, enabling faster topic modeling, sentiment analysis, and voice of market insights. Designed a Power BI dashboard that distills social-media comments into sentiment timelines, topic clusters, and top product issues, reducing merchandiser insight- gathering time by 30 %. Prototyped an Azure OpenAI summarization chatbot that answers ad-hoc questions in seconds, using fine-tuned BERT and VADER sentiment signals for accurate, context- aware responses. Web Developer Intern, Tantransh Solutions, Nagpur, Maharashtra, India (Remote)May 2020 - Aug 2020 Designed and developed a blogging platform using Ruby on Rails, implementing user authentication, post creation, comment management to validate core functionality and gather stakeholder feedback. Optimized database schemas and query logic, reducing execution times by 30 % and improving data retrieval speed for complex joins and multi-table queries. Implemented basic caching, database indexing, and load balancing concepts to improve response times and scalability for future deployment. Built responsive, mobile-first front-end interfaces using HTML, CSS, Bootstrap, and JavaScript, ensuring consistent performance across devices for early-stage user testing. Collaborated with cross-functional teams (engineering, marketing, product) to refine feature requirements and present working demos, cutting strategy meeting prep time by 20 %. Integrated Google Analytics to track user interactions, uncover feature gaps, and prioritize development efforts based on real-time usage data. EDUCATION Seattle University, Seattle, United States - Master, Data ScienceSep 2022 - Jun 2025 Focused on Statistical Machine Learning, Big Data Analytics, Data Management, Data Visualization, and Cloud Computing, gaining hands-on experience with Python, R, SQL, Hadoop, Spark, and D3.js. St. Vincent Pallotti College of Engineering and Technology, Nagpur, India - Bachelor, Computer EngineeringJul 2017 - Dec 2021 Gained a strong foundation in Data Structures, Algorithms, Distributed Systems, Operating Systems, Computer Networks, Theory of Computation, Software Engineering, and Object-Oriented Programming (C++, Java, Python). CERTIFICATIONS Google Cloud Big Data and Machine Learning Fundamentals, CourseraAug 2020 Basic Artificial Neural Networks in Python, CourseraSep 2020 Neural Networks and Deep Learning, CourseraOct 2020 PROJECTS House Tenure Prediction Analysis, LinkApr 2024 - Apr 2024 Built an SVM model on 75,000+ census records, achieving ~80% accuracy through data transformation, feature selection, and hyperparameter tuning. Conducted data analysis and extraction, identifying key predictors like income, education level, and employment status, offering business insights for real estate and housing policies. Seattle Bird Call Classification, LinkApr 2024 - May 2024 Designed a CNN-based classifier for spectrogram-based classification, achieving 96% binary accuracy and 71% multi-class accuracy using deep learning and adaptive learning rates. Preprocessed 500,000+ audio samples using Librosa (noise filtering, resampling, spectrograms) and developed a scalable data pipeline for real-time ecological monitoring, integrating big data processing & AI-driven automation. SKILLS & INTERESTS Cloud & Big Data::AWS, Microsoft Azure, Google Cloud Platform, BigQuery, Azure Synapse, Hadoop MapReduce, PySpark, Spark Streaming, Apache Cassandra, DynamoDB, Data Pipelines, Data Warehousing, API Integration, Data Lake Management Programming & Scripting:Python, SQL, R, C++, DAX Machine Learning & AI:NLP (BERT, VADER), CNN, Logistic Regression, Linear Regression, Reinforcement Learning, Support Vector Machine, Clustering, Text Classification Data Visualization:Tableau, Power BI, Looker, Alteryx, D3.js, Matplotlib, Seaborn, Plotly Frameworks and Tools:TensorFlow, Keras, Flask, Rasa, Dialogflow, Google Workspace, Docs, NLTK (NLP Analysis), Excel, Google Sheets, Jira, Docker, VS Code Data Engineering and Modeling:Data Extraction, Data Transformation, Data Modeling, ETL Pipelines, Data Quality Managemen, Data Integration, Batch and Real- Time Data Processing Business & Management:Business Insights, Usability, Customer Service, Product Management, Process Optimization Domains:E-Commerce, Retail, Social Media, Marketing Analytics PUBLICATIONS Survey on Discrete Gesture Recognition Techniques, International Journal of Advance Research, Ideas and Innovations in TechnologyMay 2021 Published peer-reviewed paper on Gesture Recognition Techniques (IJARIIT, May 2021), comparing vision-based, data glove, and marker-based methods for Human-Computer Interaction (HCI). Evaluated algorithms like Viola-Jones, Haar Cascade, and Arc of Reference for accuracy, efficiency, and real-world applications in AI-driven interfaces and assistive technologies.",
  "sop": "Statement Of Purpose: Hrishikesh Dhole As the world becomes increasingly digital, we openly embrace the universality of data in every device or technology we use. I have always been fascinated by this omnipresence of data reaching into our lives. So, when I was introduced to computer science and coding as a teenager, I found myself mesmerized by the world of data. So, for my interest in this field, I have been focusing on my academic pursuits to this end. As a school student, I have had a strong aptitude for science and mathematics-related subjects and a curiosity to learn more. I worked hard to get the best results and got an above-average score in the school. With adequate grades academically, I decided to pursue a Bachelor's Degree in Computer Engineering. I completed my Bachelor's Degree in Computer Engineering in 2021 with distinction from St. Vincent Pallotti College of Engineering and Technology, Nagpur. They were splendid four years of my academic life where I experienced the most challenging and memorable times. The program's inflexible curriculum was planned and challenging enough to bring out the best in me at college. I enjoyed studying various subjects such as Programming, Soft-Computing, Software Testing & Quality Assurance, and many more. And not just from the university, but to improve my practical skills, I have also done online graded courses on Machine Learning, Artificial Neural Networks, and Deep Learning. I keep myself updated with the latest trends in technology by reading through several research papers and technical magazines. During my final year, I worked on a project titled \"Gesture-Based Automation System.\" This project aims to control various computer applications such as media players, web browsers, and PowerPoint presentations using different hand gestures. We used datasets to train our gesture recognition model and connect them with hotkeys of our keyboard to give controls to the functions of the applications (here, we use these gestures to control the VLC media player). We used various concepts of Artificial Neural Networks, Computer Vision, Machine Learning, and Python as a programming language to build this project. Based on this project, we decided to publish a survey paper titled \"Discrete Gesture Recognition Techniques.” This survey paper was about different gesture recognition techniques used by other developers in various technological projects. Our survey paper was published in an international journal named IJARIIT (International Journal of Advance Research, Ideas, and Innovations in Technology). I received high grades due to this project. The professors appreciated me since I was the project leader and delivered the appropriate work as per expectations in coordination with my team. With the core knowledge in the field, I did an internship mainly on web development and handling and regularly updating the website. It allowed me to work through many scripts and optimize a website. I have also done certified courses from Udemy and Coursera online in machine learning, ANN (Artificial Neural Networks), and Deep Learning which has developed my proficiency in Data Science with Machine learning. Statement Of Purpose: Hrishikesh Dhole Besides academics, I was involved in various organizations such as the NSS (National Service Scheme), CSI (Computer Society of India), and ACM (Automated Computer Machinery) Student chapter. I was Class Representative during my 1st and 2nd year. I was elected as a Treasurer in our ACM Student Chapter in my third year. As a treasurer, my responsibilities were to maintain all chapter financial records and checkbooks and coordinate membership procedures and fees with the membership chairperson. With my excellent track record and my contributions to the chapter during that whole year, I was elected as Vice-chairperson in my final year. For my future, I want to make a career in data science by pursuing MS in Data Science. This graduate program will train me in statistical analysis methods and the programming knowledge needed to complete large data-driven tasks. I look forward to enhancing my programming and mathematical shrewdness through my coursework. Additionally, the opportunities to work with industry partners on the projects will give me additional experience working directly on relevant topics of the field. Finally, this graduate program will provide me with the knowledge and technical expertise that I will need to continue my career as a data scientist."
}